runs/stateful/full_paper/exp1_ttft_reduction_llama3_sglang/sglang_runs/meta-llama_Meta-Llama-3-8B-Instruct/ctx8128_out64_a16_b8_s0/sglang_bench_raw.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=50096, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8128, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:50096/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=50096, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='meta-llama/Meta-Llama-3-8B-Instruct', served_model_name=None, tokenizer='meta-llama/Meta-Llama-3-8B-Instruct', num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8128, random_output_len=64, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 137151
#Output tokens: 952
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  6.17      
Total input tokens:                      137151    
Total input text tokens:                 137151    
Total generated tokens:                  952       
Total generated tokens (retokenized):    951       
Request throughput (req/s):              5.18      
Input token throughput (tok/s):          22214.12  
Output token throughput (tok/s):         154.19    
Peak output token throughput (tok/s):    811.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          22368.31  
Concurrency:                             29.88     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   5764.74   
Median E2E Latency (ms):                 5809.28   
P90 E2E Latency (ms):                    6113.20   
P99 E2E Latency (ms):                    6153.98   
---------------Time to First Token----------------
Mean TTFT (ms):                          2846.75   
Median TTFT (ms):                        2917.03   
P99 TTFT (ms):                           5456.84   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          223.58    
Median TPOT (ms):                        116.44    
P99 TPOT (ms):                           2106.38   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           101.50    
Median ITL (ms):                         11.19     
P95 ITL (ms):                            13.36     
P99 ITL (ms):                            3859.38   
Max ITL (ms):                            5204.75   
==================================================


  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:03<01:34,  3.06s/it]
  6%|▋         | 2/32 [00:05<01:21,  2.72s/it]
 28%|██▊       | 9/32 [00:05<00:09,  2.45it/s]
 41%|████      | 13/32 [00:05<00:04,  3.93it/s]
 62%|██████▎   | 20/32 [00:05<00:01,  7.49it/s]
 78%|███████▊  | 25/32 [00:06<00:00, 10.16it/s]
100%|██████████| 32/32 [00:06<00:00, 15.38it/s]
100%|██████████| 32/32 [00:06<00:00,  5.19it/s]